app/Controllers/CheckoutController.php

    public function checkoutList()
    {
        $CheckoutModel = new CheckoutModel();
        $data['users'] = $CheckoutModel->orderBy('c_id', 'ASC')->findAll();
---
SELECT *
FROM `checkout`
ORDER BY `c_id` ASC

    public function store() {
        $CheckoutModel = new CheckoutModel();
        $data = [
            'c_warna' => $this->request->getVar('c_warna'),
            'c_ukuran'  => $this->request->getVar('c_ukuran'),
            'c_pembayaran'  => $this->request->getVar('c_pembayaran'),
            'c_shipment'  => $this->request->getVar('c_shipment'),
            'c_tanggal'  => date('Y-m-d H:i:s'),

        ];
        $CheckoutModel->insert($data);
---
INSERT INTO `checkout` (`c_warna`, `c_ukuran`, `c_pembayaran`, `c_shipment`, `c_tanggal`) VALUES ('Black', 'M', 'QRIS', 'Express Shipping', '2023-12-18 15:33:04')