app/Controllers/DetailController.php

    public function detailList()
    {
        $DetailModel = new DetailModel();
        $data['users'] = $DetailModel
            ->join('checkout', 'checkout.c_id = detail.d_id')
            ->join('produk', 'produk.p_id = detail.d_id')
            ->join('user', 'user.u_id = detail.d_id')
            ->findAll();
---
SELECT *
FROM `detail`
JOIN `checkout` ON `checkout`.`c_id` = `detail`.`d_id`
JOIN `produk` ON `produk`.`p_id` = `detail`.`d_id`
JOIN `user` ON `user`.`u_id` = `detail`.`d_id`

    public function history()
    {
        $DetailModel = new DetailModel();
        $data['users'] = $DetailModel
            ->join('checkout', 'checkout.c_id = detail.d_id')
            ->join('produk', 'produk.p_id = detail.d_id')
            ->join('user', 'user.u_id = detail.d_id')
            ->findAll();
---
SELECT *
FROM `detail`
JOIN `checkout` ON `checkout`.`c_id` = `detail`.`d_id`
JOIN `produk` ON `produk`.`p_id` = `detail`.`d_id`
JOIN `user` ON `user`.`u_id` = `detail`.`d_id`