app/Controllers/ProdukCrud.php

SELECT *
FROM `produk`
ORDER BY `p_id` ASC
---
    public function admin(){
        $produkModel = new ProdukModel();
        $data['users'] = $produkModel->orderBy('p_id', 'ASC   ')->findAll();

SELECT *
FROM `produk`
ORDER BY `p_id` ASC
---
    public function index(){
        $produkModel = new ProdukModel();
        $data['users'] = $produkModel->orderBy('p_id', 'ASC   ')->findAll();

SELECT *
FROM `produk`
ORDER BY `p_id` ASC
---
    public function confirmation(){
        $produkModel = new ProdukModel();
        $data['users'] = $produkModel->orderBy('p_id', 'ASC   ')->findAll();