app/Controllers/UserCrud.php

SELECT *
FROM `user`
ORDER BY `u_id` ASC
---
    public function admin(){
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('u_id', 'ASC   ')->findAll();